code-review/NRB_3471_3546/База_Стало/Reports/РегуляторнаяОтчетность_Форма_0409707_7_0.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>РегуляторнаяОтчетность_Форма_0409707_7_0</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеИзDiasoft</Name>
					<Comment>Список документов ДанныеИзDiasoft, данные из которых участвуют в формировании отчета</Comment>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеПодраздела1_1</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КатКлиент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусКл</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОКАТО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолКлиент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеПодраздела1_2</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСчДЕПО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолСчДЕПО</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолСчДЕПОполож</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеПодраздела1_3</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодВидаОперации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДоходов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРасходов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Reports/РегуляторнаяОтчетность_Форма_0409707_7_0/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.Организация = Константы.ОрганизацияПоУмолчанию.Получить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодНачалоПриИзменении(Элемент)
	ОчиститьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ПериодКонецПриИзменении(Элемент)
	ОчиститьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОчиститьОтчет();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыборПериода(Команда)
	Если РаботаСДиалогамиКлиент.ИзмененПериод(Отчет.ПериодНачало, Отчет.ПериодКонец) Тогда
		ОчиститьОтчет();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	Если Не ЗначениеЗаполнено(Отчет.ПериодНачало) Или Не ЗначениеЗаполнено(Отчет.ПериодКонец) Тогда
		Текст = "Не указан период, за который должен быть постоен отчет!";
		Если Не ЗначениеЗаполнено(Отчет.ПериодКонец) Тогда
			ПутьКДанным = "Отчет.ПериодКонец";
		Иначе
			ПутьКДанным = "Отчет.ПериодНачало";
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , , ПутьКДанным);
	Иначе
		Если НачалоГода(Отчет.ПериодНачало) <> НачалоГода(Отчет.ПериодКонец) Тогда
			Текст = "Указанный отчетный период охватывает разные календарные годы!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , , "Отчет.ДанныеИзDiasoft");
		КонецЕсли;
		ПодобратьДанныеDiasoft();
		НайденоЗагрузок = Отчет.ДанныеИзDiasoft.Количество();
		Если КоличествоМесяцевВПериоде > НайденоЗагрузок Тогда
			Текст = "Не найдены все необходимые загрузки данных из внешней системы для заполнения подраздела 1.3 !"
					+ " Найдено загрузок " + Строка(НайденоЗагрузок) + " из " + Строка(КоличествоМесяцевВПериоде) + " ...";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , , "Отчет.ДанныеИзDiasoft");
		КонецЕсли;
		СформироватьОтчетСервер();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьXML(Команда)
	СформироватьНаСервереXML();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьОтчетСервер()
	Перем ДанныеДляРасшифровки1_1;
	Перем ДанныеДляРасшифровки1_2;
	Перем ДанныеДляРасшифровки1_3;
	
	ВремяНачалаЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	
	Отчет.ОтчетнаяДата = КонецДня(Отчет.ПериодКонец) + 1; // следующий день после даты конца выбранного отчетного периода
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	ОтчетОбъект.ПолучитьДанные1_1(ДанныеДляРасшифровки1_1);
	Макет1_1 = ОтчетОбъект.ПолучитьМакет("МакетПодраздела1_1");
	ТабДок1_1 = РегуляторнаяОтчетность.ЗаполненныйДаннымиМакетПодраздела(Макет1_1, ОтчетОбъект.ДанныеПодраздела1_1);
	Макет = ОтчетОбъект.ПолучитьМакет("МакетРасшифровкиКПодразделу1_1");
	ТабДок_РасшифровкаКРазделу1_1 = РегуляторнаяОтчетность.ЗаполненныйДаннымиМакетПодраздела(Макет, ДанныеДляРасшифровки1_1);
	
	ОтчетОбъект.ПолучитьДанные1_2(ДанныеДляРасшифровки1_2);
	Макет1_2 = ОтчетОбъект.ПолучитьМакет("МакетПодраздела1_2");
	ТабДок1_2 = РегуляторнаяОтчетность.ЗаполненныйДаннымиМакетПодраздела(Макет1_2, ОтчетОбъект.ДанныеПодраздела1_2);
	Макет = ОтчетОбъект.ПолучитьМакет("МакетРасшифровкиКПодразделу1_2");
	ТабДок_РасшифровкаКРазделу1_2 = РегуляторнаяОтчетность.ЗаполненныйДаннымиМакетПодраздела(Макет, ДанныеДляРасшифровки1_2);
	
	ОтчетОбъект.ПолучитьДанные1_3(ДанныеДляРасшифровки1_3);
	Макет1_3 = ОтчетОбъект.ПолучитьМакет("МакетПодраздела1_3");
	ТабДок1_3 = РегуляторнаяОтчетность.ЗаполненныйДаннымиМакетПодраздела(Макет1_3, ОтчетОбъект.ДанныеПодраздела1_3);
	Макет = ОтчетОбъект.ПолучитьМакет("МакетРасшифровкиКПодразделу1_3");
	ТабДок_РасшифровкаКРазделу1_3 = РегуляторнаяОтчетность.ЗаполненныйДаннымиМакетПодраздела(Макет, ДанныеДляРасшифровки1_3);
	
	ЗначениеВРеквизитФормы(ОтчетОбъект, "Отчет");
	Элементы.ФормаСохранитьXML.Доступность = Истина;
	
	Элементы.НайденныеОшибки.Видимость = Не ПустаяСтрока(Отчет.ОписаниеОшибок);
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени("РегуляторнаяОтчетностьПоФорме0409707_5_0_Формирование", ВремяНачалаЗамера);
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервереXML()
	ВремяНачалаЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.ВыгрузитьВXML();
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени("РегуляторнаяОтчетностьПоФорме0409707_ВыгрузкаВXML", ВремяНачалаЗамера);
КонецПроцедуры

&НаСервере
Процедура ОчиститьОтчет()
	Отчет.ДанныеПодраздела1_1.Очистить();
	Отчет.ДанныеПодраздела1_2.Очистить();
	Отчет.ДанныеПодраздела1_3.Очистить();
	Отчет.ДанныеИзDiasoft.Очистить();
	ТабДок1_1.Очистить();
	ТабДок_РасшифровкаКРазделу1_1.Очистить();
	ТабДок1_2.Очистить();
	ТабДок_РасшифровкаКРазделу1_2.Очистить();
	ТабДок1_3.Очистить();
	
	Элементы.ФормаСохранитьXML.Доступность = Ложь;
КонецПроцедуры

&НаСервере
Функция ТаблицаМесяцевВПериоде(МассивМесяцев)
	ТЗМесяцы = Новый ТаблицаЗначений;
	ТЗМесяцы.Колонки.Добавить("ДатаНачалаМесяца", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТЗМесяцы.Колонки.Добавить("ДатаОкончанияМесяца", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	
	Для Каждого ДатаНачалаМесяца Из МассивМесяцев Цикл
		НоваяСтрока = ТЗМесяцы.Добавить();
		НоваяСтрока.ДатаНачалаМесяца = ДатаНачалаМесяца;
		НоваяСтрока.ДатаОкончанияМесяца = НачалоДня(КонецМесяца(ДатаНачалаМесяца));
	КонецЦикла;
	
	Возврат ТЗМесяцы;
КонецФункции

&НаСервере
Процедура ПодобратьДанныеDiasoft()
	Если Не ЗначениеЗаполнено(Отчет.ПериодНачало) Или Не ЗначениеЗаполнено(Отчет.ПериодКонец) Тогда
		Отчет.ДанныеИзDiasoft = Неопределено;
		Возврат;
	КонецЕсли;
	
	ПериодДанныхКонец = КонецМесяца(Отчет.ПериодКонец);
	ПериодДанныхНачало = НачалоГода(Отчет.ПериодНачало);
	МассивМесяцев = ОбщегоНазначения.КалендарныеМесяцыПопавшиеВПериод(ПериодДанныхНачало, ПериодДанныхКонец);
	КоличествоМесяцевВПериоде = МассивМесяцев.Количество();	// Используется не тут, а позже, для проверки пред формированием отчета
	ТЗМесяцы = ТаблицаМесяцевВПериоде(МассивМесяцев);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЗМесяцы.ДатаНачалаМесяца КАК ДатаНачалаМесяца,
	|	ТЗМесяцы.ДатаОкончанияМесяца КАК ДатаОкончанияМесяца
	|ПОМЕСТИТЬ ВТ_Месяцы
	|ИЗ
	|	&ТЗМесяцы КАК ТЗМесяцы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Месяцы.ДатаНачалаМесяца КАК ДатаНачалаМесяца,
	|	ВТ_Месяцы.ДатаОкончанияМесяца КАК ДатаОкончанияМесяца,
	|	МАКСИМУМ(ДанныеИзDiasoft.Дата) КАК ДатаПоследнейЗагрузки
	|ПОМЕСТИТЬ ВТ_ДатыПоследнихЗагрузокДанных
	|ИЗ
	|	ВТ_Месяцы КАК ВТ_Месяцы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ДанныеИзDiasoft КАК ДанныеИзDiasoft
	|		ПО ВТ_Месяцы.ДатаНачалаМесяца = ДанныеИзDiasoft.НачалоПериода
	|			И ВТ_Месяцы.ДатаОкончанияМесяца = ДанныеИзDiasoft.КонецПериода
	|			И (ДанныеИзDiasoft.ВидДанных = ЗНАЧЕНИЕ(Перечисление.ВидыДанныхИзDiasoft.ДоходыИРасходыОтносящиесяКДепозитарнойДеятельности))
	|			И (НЕ ДанныеИзDiasoft.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Месяцы.ДатаНачалаМесяца,
	|	ВТ_Месяцы.ДатаОкончанияМесяца
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ДанныеИзDiasoft.Ссылка) КАК Загрузка
	|ИЗ
	|	ВТ_ДатыПоследнихЗагрузокДанных КАК ВТ_ДатыПоследнихЗагрузокДанных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ДанныеИзDiasoft КАК ДанныеИзDiasoft
	|		ПО ВТ_ДатыПоследнихЗагрузокДанных.ДатаНачалаМесяца = ДанныеИзDiasoft.НачалоПериода
	|			И ВТ_ДатыПоследнихЗагрузокДанных.ДатаОкончанияМесяца = ДанныеИзDiasoft.КонецПериода
	|			И ВТ_ДатыПоследнихЗагрузокДанных.ДатаПоследнейЗагрузки = ДанныеИзDiasoft.Дата
	|			И (ДанныеИзDiasoft.ВидДанных = ЗНАЧЕНИЕ(Перечисление.ВидыДанныхИзDiasoft.ДоходыИРасходыОтносящиесяКДепозитарнойДеятельности))
	|			И (НЕ ДанныеИзDiasoft.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДатыПоследнихЗагрузокДанных.ДатаНачалаМесяца";
	Запрос.УстановитьПараметр("ТЗМесяцы", ТЗМесяцы);
	МассивДокументовДанныеИзDiasoft = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Загрузка");
	Отчет.ДанныеИзDiasoft.ЗагрузитьЗначения(МассивДокументовДанныеИзDiasoft);
КонецПроцедуры

#КонецОбласти
